[
  {
    "path": "posts/2022-02-17-istanbul-and-food-delivery-an-inflated-affair/",
    "title": "Istanbul and Food Delivery: An Inflated Affair",
    "description": "100% inflation rate in 18 months",
    "author": [
      {
        "name": "Efe Baslar",
        "url": {
          "https://baslare.net": {}
        }
      }
    ],
    "date": "2022-02-21",
    "categories": [],
    "contents": "\r\n\r\nContents\r\nHumble beginnings\r\nThe PunchlineIn need of a representative statistic\r\n\r\nMoving Beyond Lahmacun\r\nOLS estimation\r\nFinal Word\r\n\r\n\r\nbody {\r\ntext-align: justify}\r\nHumble beginnings\r\nAs with my major data analysis/science projects, this one has followed a course of growth over the last couple of years. As my approach changed, the product manifested itself in different and more detailed forms (for the better, I would say). But the main reason I am interested in food data is still the same. That is, well, that there are fundamental differences in how people from different backgrounds make eating decisions on a daily basis. After all, we are what we eat.\r\nOr, is it the other way around?\r\nI am not only talking about religion-driven or simple income-induced differences. Even eating can get political under particular conditions and certain edible items can and will be perceived as signals for association with a social group, as these signals usually become even more salient in polarized social settings (DellaPosta, Shi, and Macy 2015). As I continue exploring food industries in various locations (next up: Berlin), I took a detour to revisit Turkey’s leading but increasingly infamous1 food2 delivery leviathan: yemeksepeti.com.\r\nOne and a half year ago, for a tweet of mine that became somewhat of a hit (which I linked just below), I had tapped into the aforementioned delivery service for the first time. Scraping the data off it was rather straight forward: crawling JavaScript based content was not strictly necessary unless you wanted to have access to restaurants that are not open for delivery at that time of the day. This required (and still does) activating a simple check-box that triggered a JavaScript event that listed the restaurants regardless of their state. I did not particularly like that there was a possibility that some restaurants didn’t get picked up by the rvest script but I still went along with scraping the data during the peak hours because I did not actually have much free time then. Fast forward a couple days, I had curated a data set that featured the menus of a sizable portion of the restaurants in Istanbul that partnered up with yemeksepeti, and the list of neighborhoods these restaurants served.\r\nSpeaking of web-scraping, here is the github repository for this most recent version of the project. I will try to make available all my projects unless I suspect that there might be possible terms of service violations with publicizing the codes and/or data. Whatever, back to the task at hand: This time around, I used Selenium in python to collect the links to each restaurant and rvest in R to collect the menus.\r\nAlright, back to September 2020. if you are interested - which you probably are, if you are here reading this post -, just take a look at the tweet. The main idea is that there are considerable differences in average Lahmacun prices (a popular dough, spice and meat based food, sometimes referred to as the “Turkish Pizza”, woefully) across different districts in Istanbul. Naturally, the richer and the more attractive is the district, the higher are the prices… ostensibly. But is it that simple? There are numerous deviations from what you would expect based on that intuition and we might want to investigate this further. So, one of my motivations was to improve the script and delve further into the dynamics that surround the pricing of Lahmacun and other practical foods.\r\n\r\npreservebbe144e3166587aa\r\n\r\nIn addition to my usual rationale for getting my hands dirty around the inspect functionality of my Firefox browser, I had to satiate my curiosity in one additional aspect. If you are keeping track of the news then you might possibly have heard of inflation soaring high3 in Turkey and if you are a little perceptive, you might also have noticed that the official figures for annual inflation4 are met with stark suspicion5, well, for a plethora of reasons. So, for taking a peek at what “true” inflation looks like, there isn’t a much better way than utilizing a service that Istanbulites have come to rely upon even more heavily in the Covid-19 world. Alright, without further ado, let us move on to the punchline.\r\nThe Punchline\r\n\r\n\r\npreserveeb875d0f7a089dbc\r\n\r\nFigure 1: Average lahmacun prices in each Istanbul district: Use the plotly controls on the upper right corner to navigate the plot!\r\n\r\n\r\n\r\nOK. Take a look at the map above. Move your mouse cursor over the districts for more information, if you’d like. Take a look at the previous iteration of the same map. Yup. It is correct. The prices have increased around 100% and that happened within a span of 18 months. Let that sink in. And no, I have not changed my methodology greatly, barring some improvements for more accurate estimation. I’ll be detailing these improvements below but overall it is pretty similar to one I had then. Overall, inflation seem to be running rampart in the food industry and the prices seem to have inflated equally across districts: around a whopping 100%! The figures are based on 2198 yemeksepeti partner restaurants with Lahmacun on their menu (those that satisfy some qualifications I laid out below).\r\nThe districts with a sizable secular, upper-middle class residents (read: economically better off) seem to be the ones in which you can have the most pricey lahmacuns. But the number of restaurants serving in each district is not necessarily proportional to the population residing within that district. It shouldn’t come as a surprise when I tell youthat it is mostly the younger inhabitants, especially university students that use food delivery services.\r\nIn need of a representative statistic\r\nNow, let us dive into some details about how this plot was created. Creating the plots was definitely not as straightforward as the maps themselves seem. I mentioned just above that I had made some improvements in my approach. Improvements seldom come without any further complexity and this is one of those cases (not always, of course).\r\nyemeksepeti lists 961 precinct equivalent divisions for its partner network in Istanbul. This is deceptively similar to the true number of precincts in Istanbul, which stands at 964. However, some precincts are arbitrarily divided by yemeksepeti for operational reasons, as precincts are hardly homogeneous across different districts in Istanbul and not necessarily equally reachable: they range from a few hundred of inhabitants to a hundred thousand.\r\nPrecincts constitute the smallest possible Turkish administrative unit, as per the latest regulations. Districts, depicted on the maps in this post, house a number of districts. Basic math tells us that for each of the 39 districts in Istanbul we can expect to observe around 25 precincts. The way yemeksepeti stores its data doesn’t tell much about where a restaurant is located. It would have been amazing to be able to have access to geolocation data but a web-scraper must live with what he can get his hands on.\r\nEven knowing about the precise locations of each restaurant would not be able to change a simple fact: restaurant deliveries are trans-precinct and most of the time trans-district. Each precinct is (literally) fed by a number of restaurants located in an around itself and some precincts are served by more restaurants than other precincts. Even though I was aware of this simple fact when I first delved into yemeksepeti data, I had only taken a simple average for each district, without giving any effort to create a more representative statistic under this particular structure of the data.\r\n\r\n\r\n\r\nFigure 2: A sample listing of restaurants, the restaurant at the bottom is around 15 kilometers away from the focal precinct and has a huge minimum delivery amount for a lahmacun bakery.\r\n\r\n\r\n\r\nIn addition, programmatically searching each restaurant’s menu for the product of interest (“Lahmacun”, in this particular case), has its own problems. If your goal is to filter everything with “Lahmacun” in its name, then you are in for a treat because you are going to get every form of seemingly relevant item in the results. The solution is to include some keywords or other elements you do not want to see. Since I wanted to focus as much as possible to the single, I employed that solution. You can refer to my github repository if you are interested in how I filtered out the “lahmacuns of interest”.\r\nFurthermore, most of the partner restaurants have set a minimum threshold on the total amount of the order in TL, conditional on the precinct they serve. The customer therefore must surpass that threshold in order to guarantee a delivery for the order. Although I sincerely doubt that these values are issued with any meticulous calculation, the underlying rationale probably draws from a simple and rational mechanism: cost-benefit trade-off.\r\nIf a restaurant sets too high a threshold, then it could mean that they regard that particular customer to be to far away and that it is not worth it to send out a rider for that delivery or that the restaurant is too fancy for a small delivery. There are some ridiculous combinations, e.g. a Lahmacun restaurant requiring a minimum 1000 TL delivery amount for some precincts (Since you have studied the map above you know you would need to order around 50 Lahmacuns on average to qualify for such delivery), or a fancy restaurant offering its gourmet Lahmacun for around 90 TL.\r\nIt is obvious that a person looking for a regular Lahmacun would hardly consider those kind of restaurants to be among viable alternatives for his lovely lahmacun-to-be. But, in theory, that particular restaurant is still part of the restaurants that serve that specific precinct and should somehow be incorporated into the statistic. My solution is to apply a weighted average based on this delivery threshold (you can see a sample of restaurants with different thresholds in the screenshot above).\r\nLet \\(p_i\\) denote the weighted average of the restaurants serving the precinct \\(i\\), \\(t_{ij}\\) is the threshold associated with restaurant \\(i\\) serving to the precinct \\(j\\) and \\(p_{j}\\) corresponds to the price of a product at restaurant \\(j\\), to my knowledge the restaurants do not engage in variable pricing, therefore the prices are invariant to \\(i\\). Yes, the prices in each restaurant are weighted by the inverse of the threshold \\(t_{ij}\\). You can notice that some restaurants have a threshold of 0, so I just replaced those values with 10. In addition, because the number that serve each precinct can differ, it is worthwhile to keep the number of restaurants serving each precinct. I used the restaurant counts as weights for each precinct when calculating the weighted average for each district.\r\n\\[p_i = \\sum_{j \\in J}\\frac{p_{j}/t_{ij}}{\\sum_{j \\in J} 1/t_{ij}}\\]\r\nAssuming that everything went according to the plan, we get a list of all the precinct-equivalent units at yemeksepeti, with all the desired statistics. Thankfully, within the URL to each of the precinct-equivalent units we have the name of the district it belongs to. This gives us, with some regular expressions workaround, the possibility of extracting the names of each Istanbul district. After doing all the processing, we get a list of the 39 districts and the corresponding weighted-average lahmacun prices. Yep. That was that simple.\r\nNext up, even though I cannot provide any benchmark for the severity of the consumer inflation of other food items, you can find below maps and charts for Hamburgers and Beef/Chicken Döners. In the section that follows, I’ll a bit about a couple of regression models to dig deeper into precinct-based, rather than district based analyses.\r\n\r\n\r\n\r\nWhile you are still here take a look at the histogram below of Lahmacun restaurant prices in the entire data set. The average price is around 16.30 TL, which is slightly over 1 euro.\r\n\r\n\r\npreserve27e8d70c294bd558\r\n\r\nFigure 3: Histogram of average restaurant prices for lahmacun\r\n\r\n\r\n\r\nMoving Beyond Lahmacun\r\nI’ll refrain from engaging in commenting in detail too much on the plots below as they follow the same principles I laid out above and I believe they can speak for themselves. These may not make much sense without a benchmark, but the price patterns observed for Lahmacun seem to persist across other deliverable food. The table below summarizes the number of restaurants that I used for calculation of the weighted average prices.\r\n\r\n\r\nTable 1: The number of restaurants offering each product\r\n\r\n\r\nProduct\r\n\r\n\r\nn\r\n\r\n\r\nLahmacun\r\n\r\n\r\n2198\r\n\r\n\r\nBurger\r\n\r\n\r\n2799\r\n\r\n\r\nDöner\r\n\r\n\r\n1805\r\n\r\n\r\nTavuk Döner\r\n\r\n\r\n1569\r\n\r\n\r\n\r\n\r\npreserve556d2acab8789bd5\r\n\r\nFigure 4: Average Burger prices in each Istanbul district: Use the plotly controls on the upper right corner to navigate the plot!\r\n\r\n\r\n\r\nIstanbul has a curious penchant for making tasty Burgers and this is evidenced by the highest number of restaurants serving Burger, among the four food articles I selected. I know for sure that university students are particularly fond of eating burgers, restaurants of which are quite ubiquitous in the more well-off Besiktas and Kadiköy districts. Hence the higher prices. Working class majority districts including Esenler and Sultanbeyli, and the Istanbul “countryside” Catalca and Sile almost always feature the least expensive alternatives, regardless of the food in question.\r\n\r\n\r\n\r\n\r\n\r\npreserve6f3e729886ed5b61\r\n\r\nFigure 5: Average beef döner prices in each istanbul district: Use the plotly controls on the upper right corner to navigate the plot!\r\n\r\n\r\n\r\nThe Turkish döner usually comes in two variants: beef and chicken, with the former being the more expensive alternative. The latter has its own popularity mainly thanks to its accessibility. I enjoy both equally but at the same time believe that there are certain circumstances in which one of them should trump over the other. Both seem to follow similar patterns, as most of the time they are offered by the same restaurant (at the same time, some restaurants can be chicken-exclusive).\r\n\r\n\r\n\r\n\r\n\r\npreserveb990a9b60255c068\r\n\r\nFigure 6: Average chicken döner prices in each istanbul district: Use the plotly controls on the upper right corner to navigate the plot!\r\n\r\n\r\n\r\nOLS estimation\r\nI would now like to tend to the question I posed in the beginning: what are the factors that contribute to the pricing of various food items? I brought in two different sources of data to create covariates to explain the variance in price. First, I utilized the API of the Istanbul Metropolitan Municipality for its (rather outdated) open data source6. The data I collected gives us access to precinct level demographic records. Those that are relevant for us are the precinct population and its brakedown to various age-sex intervals, and the share of university graduates among the residents of that precinct. Second, I brought in the results of the most recent election in Istanbul: the rerun of the 2019 the mayoral elections, at the precinct level as well.\r\nWe are now set to see if voting behavior and certain demographics are in any way related to variation in prices of each of the four food articles we talked about. Since I would love to evade multicolinearity as much as possible, I tried to “merge” the information from correlated and relevant variables into one variable. The model specification is as follows:\r\n\\[\\small price_i = rating_i + log(pop_i) + count_i + AKP{\\%\\_}CHP{\\%}{\\_}diff_i + youth{\\%\\_}diff_i \\] where the dependent variable \\(price_i\\) is the average product price in restaurants serving the precinct \\(i\\), explained by the (weighted) average rating of the restaurants serving the precinct, logarithm of the precinct population, the number of restaurants serving that product, the difference in vote shares of AKP (Erdogan’s party) and (the main opposition: social democrats), and the differences in the ratios between males and females that are between ages 15 and 39. As far as I could tell, there are no imminent endogeneity problems and it is relatively safe to use the OLS regression here.\r\n\r\n\r\n\r\n\r\n\r\n\r\nDependent variable:\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\nAverage Price\r\n\r\n\r\n\r\n\r\nLahmacun\r\n\r\n\r\nBurger\r\n\r\n\r\nDöner\r\n\r\n\r\nTavuk Döner\r\n\r\n\r\n\r\n\r\n(1)\r\n\r\n\r\n(2)\r\n\r\n\r\n(3)\r\n\r\n\r\n(4)\r\n\r\n\r\n\r\n\r\nyouth_diff\r\n\r\n\r\n0.915\r\n\r\n\r\n3.440\r\n\r\n\r\n0.607\r\n\r\n\r\n-0.963\r\n\r\n\r\n\r\n\r\n(0.840)\r\n\r\n\r\n(2.429)\r\n\r\n\r\n(1.971)\r\n\r\n\r\n(1.650)\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\nlog(pop)\r\n\r\n\r\n-0.578***\r\n\r\n-1.317***\r\n\r\n-1.180***\r\n\r\n-0.583***\r\n\r\n\r\n\r\n(0.055)\r\n\r\n\r\n(0.147)\r\n\r\n\r\n(0.131)\r\n\r\n\r\n(0.112)\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\nweighted_rating\r\n\r\n\r\n2.424***\r\n\r\n6.140***\r\n\r\n10.462***\r\n\r\n4.926***\r\n\r\n\r\n\r\n(0.283)\r\n\r\n\r\n(0.660)\r\n\r\n\r\n(0.564)\r\n\r\n\r\n(0.455)\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\nakp_chp_diff\r\n\r\n\r\n-1.445***\r\n\r\n-1.680***\r\n\r\n-3.137***\r\n\r\n-3.604***\r\n\r\n\r\n\r\n(0.199)\r\n\r\n\r\n(0.602)\r\n\r\n\r\n(0.464)\r\n\r\n\r\n(0.349)\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\nrest_count\r\n\r\n\r\n0.030***\r\n\r\n0.066***\r\n\r\n0.020**\r\n\r\n0.022***\r\n\r\n\r\n\r\n(0.003)\r\n\r\n\r\n(0.005)\r\n\r\n\r\n(0.008)\r\n\r\n\r\n(0.008)\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\nConstant\r\n\r\n\r\n-0.447\r\n\r\n\r\n2.421\r\n\r\n\r\n-41.053***\r\n\r\n-11.549***\r\n\r\n\r\n\r\n(2.447)\r\n\r\n\r\n(5.929)\r\n\r\n\r\n(4.912)\r\n\r\n\r\n(3.839)\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\nObservations\r\n\r\n\r\n780\r\n\r\n\r\n779\r\n\r\n\r\n779\r\n\r\n\r\n779\r\n\r\n\r\nR2\r\n\r\n0.464\r\n\r\n\r\n0.489\r\n\r\n\r\n0.521\r\n\r\n\r\n0.353\r\n\r\n\r\nAdjusted R2\r\n\r\n0.461\r\n\r\n\r\n0.486\r\n\r\n\r\n0.518\r\n\r\n\r\n0.348\r\n\r\n\r\nResidual Std. Error\r\n\r\n\r\n1.399 (df = 774)\r\n\r\n\r\n4.051 (df = 773)\r\n\r\n\r\n3.286 (df = 773)\r\n\r\n\r\n2.753 (df = 773)\r\n\r\n\r\nF Statistic\r\n\r\n\r\n134.027*** (df = 5; 774)\r\n\r\n\r\n148.001*** (df = 5; 773)\r\n\r\n\r\n167.914*** (df = 5; 773)\r\n\r\n\r\n84.221*** (df = 5; 773)\r\n\r\n\r\n\r\n\r\nNote:\r\n\r\n\r\np<0.1; p<0.05; p<0.01\r\n\r\n\r\nAround 200 precincts that got filtered out during the merging process of the data sources are largely due to some precincts not being served by yemeksepeti (mostly the villages in the countryside), having fewer than 500 residents and having some ambiguous naming (by yemeksepeti) that rendered me unable to tell which precinct it was. The explanatory power of the models are moderate best, regardless, there are actually some interesting insights to be gained from the results.\r\nthe more populated a precinct is, the less expensive is the product.\r\nEven though it does not seem to be a major effect and that it does not seem to be a proxy for the demand for any of the food articles selected, (over)population seem to be in a negative relationship with price. This is expected, because as with any metropolis the average income in Istanbul is usually considerably less in neighborhoods with higher population (this has some exceptions, some precincts in the (geographic) periphery of the city have gotten cluttered with high-rise housing projects in the last decade). The effects seem rather small at first, but if you recall that the precinct population in Istanbul has a huge range, a 0.1 TL increase in a 10% increase in population surely gains more weight. In addition, the average precinct price seem to be slightly affected by each increment in the number of restaurants serving that particular prencinct.\r\npeople are fine with paying more for better döner and burger, but especially for döner.\r\nAssuming that the variable average ratings for restaurants is a somewhat acceptable proxy for the quality of their output, we can see that Istanbulites are fairly OK with paying more if it means that it gets them good döner. This could in fact be related to some döner restaurants have well-established reputation. It gets even more interesting when juxtaposing the döner and burger results, on average burgers seem to be 20-30% more expensive than beef döner but restaurant ratings seem to be 60-70% more salient in their relations to restaurant prices. For beef döner, a 10 TL increase in the price seems to be justified as long as it accompanies an increase of 1 in the restaurant rating\r\nthe more a precinct favors AKP over CHP, overall it is associated with lower prices.\r\nThis is also an expected result as it is well established that AKP thrives in lower income environments whereas CHP voting is associated with high-income high-education masses. There are also numerous options for having premium döner in CHP-majority quarters, and both beef and chicken döner seem to be more sensitive to differences in AKP/CHP vote shares compared to Burger and Lahmacun. But, as discussed the AKP-CHP divide is highly pertinent to the economic divide, so this does not necessarily translate to politically driven food preferences.\r\nFinal Word\r\nThis was a fun and at times a tedious exercise (especially when dealing with inconsistent restaurant menus and precinct names) using a personally curated data set tapping into three different sources: a delivery service, precinct-level demographics data and election results. You must surely have noticed that it is still not enough to draw robust inferences and that we require more information on consumer behavior to come up with more interesting results. Most prominently, precinct-level average income data could help in disentangling political preferences from income-induced preferences. I would also have loved to carry out some geospatial analysis, if I had access to such data.\r\n\r\n\r\n\r\nButler, Daren, and Jonathan Spicer. 2022. “Turkish Inflation Soars to 36.” Reuters. Thomson Reuters. https://www.reuters.com/world/middle-east/turkey-inflation-surges-361-amid-lira-crisis-highest-since-2002-2022-01-03/.\r\n\r\n\r\n“Delivery Couriers of Food Ordering Company Yemeksepeti Continue Strike for 14th Day.” 2022. Duvar English. https://www.duvarenglish.com/delivery-couriers-of-food-ordering-company-yemeksepeti-continue-strike-for-14th-day-news-60370.\r\n\r\n\r\nDellaPosta, Daniel, Yongren Shi, and Michael Macy. 2015. “Why Do Liberals Drink Lattes?” American Journal of Sociology 120 (5): 1473–1511.\r\n\r\n\r\nOsterlund, Paul Benjamin. 2022. “As Turkey’s Inflation Rate Climbs, Workers Strike for Pay Hikes.” Workers’ Rights News | Al Jazeera. Al Jazeera. https://www.aljazeera.com/economy/2022/2/15/as-turkeys-inflation-rate-climbs-workers-strike-for-pay-hikes.\r\n\r\n\r\n“Turkey Launches Probe into Online Food Delivery Giant over Data Breach Claims.” 2021. Duvar English. https://www.duvarenglish.com/turkey-launches-probe-into-online-food-delivery-giant-yemeksepeti-over-data-breach-claims-news-59690.\r\n\r\n\r\n“Turks Skeptical of Official Inflation Figures, Say They Are Higher.” 2021. Duvar English. https://www.duvarenglish.com/turks-skeptical-of-official-inflation-figures-say-they-are-higher-news-55741.\r\n\r\n\r\n(“Turkey Launches Probe into Online Food Delivery Giant over Data Breach Claims” 2021)↩︎\r\n(“Delivery Couriers of Food Ordering Company Yemeksepeti Continue Strike for 14th Day” 2022)↩︎\r\nOsterlund (2022)↩︎\r\nButler and Spicer (2022)↩︎\r\n(“Turks Skeptical of Official Inflation Figures, Say They Are Higher” 2021)↩︎\r\nhttps://data.ibb.gov.tr/↩︎\r\n",
    "preview": "posts/2022-02-17-istanbul-and-food-delivery-an-inflated-affair/ist_lahmacun_2022.jpeg",
    "last_modified": "2022-02-21T16:07:20+01:00",
    "input_file": "istanbul-and-food-delivery-an-inflated-affair.knit.md"
  }
]
